#1、ifelse
#2、if else

#1、ifelse代码结构
# ifelse(条件, 满足条件的后果, 不满足条件的后果)
#实例1：
# 如果你的考试成绩在90以上，我就跟你买一个奥特曼，否则不买
x <- 95
x
ifelse(x > 90, '买奥特曼', '不买奥特曼')

# 80-90分之间，买小奥特曼，>90分买大奥特曼，<80分什么都不买
ifelse(x <= 90 & x >= 80, '买小奥特曼', )


#>90分和<80分
ifelse(x > 90, '买大奥特曼', '什么都不买')


ifelse(x <= 90 & x >= 80, '买小奥特曼', ifelse(x > 90, '买大奥特曼', '什么都不买'))


x1 <-55
ifelse(x1 <= 90 & x1 >= 80, '买小奥特曼', ifelse(x1 > 90, '买大奥特曼', '什么都不买'))

x2 <- 85
ifelse(x2 <= 90 & x2 >= 80, '买小奥特曼', ifelse(x2 > 90, '买大奥特曼', '什么都不买'))

#以上的例子中，仅仅是针对一个单一数值来实现的ifelse，那么，如果我的研究对象是一列向量
#ifelse仍然可以顺利使用。


#实例2：一年级有200名学生，判别这些学生的成绩等相关情况
#及格的判别标准>=60为及格，否则，不及格
mydata$是否及格 <- ifelse(mydata$成绩 >= 60, '及格', '不及格')


#总结：ifesle既可以对单个数值进行判断，也可以针对一列向量进行判断。



#2、if else语法结构
if(条件){
  满足条件的结果
}else{
  不满足条件的结果
}

#实例3： <60不及格,60-70中等，71-80良好，>80优秀
#3.1 以上例子用ifelse
h <- 85
#使用ifesle
ifelse(h < 60, '不及格', ifelse(h<=70,
      '中等', ifelse(h <= 80, '良好','优秀')))
h <- 32
ifelse(h < 60, '不及格', ifelse(h<=70,
      '中等', ifelse(h <= 80, '良好','优秀')))
h <- 65
ifelse(h < 60, '不及格', ifelse(h<=70,
    '中等', ifelse(h <= 80, '良好','优秀')))


#3.2 以上例子用if else
# <60不及格,60-70中等，71-80良好，>80优秀
k <- 99
if(k < 60){
  print('不及格')
}else{
  print('及格')
}

#
if(k < 60 ){
  print('不及格')
}else if(k <= 70 ){
  print('中等')
}else if(k < 80 ){
  print('良好')
}else{
  print('优秀')
}

k <- 76
if(k < 60 ){
  print('不及格')
}else if(k <= 70 ){
  print('中等')
}else if(k < 80 ){
  print('良好')
}else{
  print('优秀')
}

#3.3 多条件分组
#举例：女生身高达标标准是：>=160
#      男生身高达标标准是：>=170
#性别是条件1，身高是条件2
gender <- '女'
height <- 165
if(gender == '女'){
  print(ifelse(height >= 160, '达标', '不达标'))
}else{
  print(ifelse(height >= 170, '达标', '不达标'))
}

gender <- '男'
height <- 169
if(gender == '女'){
  print(ifelse(height >= 160, '达标', '不达标'))
}else{
  print(ifelse(height >= 170, '达标', '不达标'))
}

#if else只能针单个数值，当研究对象是一列向量时，if else函数
#需要结合循环语句来实现（下节课）










